# Student data
This notebook analyizes pass/fail data from a class

In [13]:
data  = [50,50,47,97,49,3,53,42,26,74,82,62,37,15,70,27,36,35,48,52,63,64]
print(data *2)

[50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64, 50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64]

In [14]:
import numpy as np
#create numpy array from list
grades = np.array(data)
#print array, in which every element in array is multiplied by 2
print(grades * 2)

[100 100  94 194  98   6 106  84  52 148 164 124  74  30 140  54  72  70
  96 104 126 128]

In [15]:
grades.shape

(22,)

In [16]:
grades[0]

np.int64(50)

In [17]:
# avarage score of array 
grades.mean()

np.float64(49.18181818181818)

In [18]:
student_hours = [10.0,11.5,9.0,16.0,10.0,4.0,12.0,8.0,6.0,14.0,15.0,13.0,7.0,5.0,14.0,6.0,8.0,7.0,9.0,11.0,13.0,12.0]

student_data = np.array([student_hours, grades])

In [19]:
student_data[0][0]

np.float64(10.0)

In [27]:
avg_hours = student_data[0].mean()
avg_grades = student_data[1].mean()

print(f'Avarage hours = {avg_hours}\nAvarage grades = {avg_grades}')

Avarage hours = 10.022727272727273
Avarage grades = 49.18181818181818

In [36]:
import pandas as pd

df_students = pd.DataFrame({'Name': ['Dan', 'Joann', 'Pedro', 'Rosie', 'Ethan', 'Vicky', 'Frederic', 'Jimmie', 
                                     'Rhonda', 'Giovanni', 'Francesca', 'Rajab', 'Naiyana', 'Kian', 'Jenny',
                                     'Jakeem','Helena','Ismat','Anila','Skye','Daniel','Aisha'],
                            'StudyHours':student_data[0],
                            'Grade':student_data[1]})

df_students

         Name  StudyHours  Grade
0         Dan        10.0   50.0
1       Joann        11.5   50.0
2       Pedro         9.0   47.0
3       Rosie        16.0   97.0
4       Ethan        10.0   49.0
5       Vicky         4.0    3.0
6    Frederic        12.0   53.0
7      Jimmie         8.0   42.0
8      Rhonda         6.0   26.0
9    Giovanni        14.0   74.0
10  Francesca        15.0   82.0
11      Rajab        13.0   62.0
12    Naiyana         7.0   37.0
13       Kian         5.0   15.0
14      Jenny        14.0   70.0
15     Jakeem         6.0   27.0
16     Helena         8.0   36.0
17      Ismat         7.0   35.0
18      Anila         9.0   48.0
19       Skye        11.0   52.0
20     Daniel        13.0   63.0
21      Aisha        12.0   64.0

In [37]:
#first element of our dataframe
df_students.loc[0]

Name           Dan
StudyHours    10.0
Grade         50.0
Name: 0, dtype: object

In [41]:
#take only variable from dataframe
df_students.loc[[0], 'Name']

0    Dan
Name: Name, dtype: object

In [42]:
df_students.query('Name == "Dan"')

  Name  StudyHours  Grade
0  Dan        10.0   50.0

In [ ]:
df_students = pd.read_csv('grades.csv', delimiter=',', header='infer')

In [49]:
df_students = pd.read_csv('grades.csv', delimiter=',', header='infer')

In [50]:
df_students

         Name  StudyHours  Grade
0         Dan       10.00   50.0
1       Joann       11.50   50.0
2       Pedro        9.00   47.0
3       Rosie       16.00   97.0
4       Ethan        9.25   49.0
5       Vicky        1.00    3.0
6    Frederic       11.50   53.0
7      Jimmie        9.00   42.0
8      Rhonda        8.50   26.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
12    Naiyana        9.00   37.0
13       Kian        8.00   15.0
14      Jenny       15.50   70.0
15     Jakeem        8.00   27.0
16     Helena        9.00   36.0
17      Ismat        6.00   35.0
18      Anila       10.00   48.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0
22       Bill        8.00    NaN
23        Ted         NaN    NaN

In [ ]:
#можно посмотреть на типы данных в колонках и кол-во null значений
df_students.isnull().sum()

Name          0
StudyHours    1
Grade         2
dtype: int64

In [56]:
#remove null values. axis=0 means remove rows, axis=1 means remove columns
df_students = df_students.dropna(axis=0)

In [57]:
df_students.isnull().sum()

Name          0
StudyHours    0
Grade         0
dtype: int64

In [ ]:
# Получить среднее количество часов обучения, используя название столбца в качестве индекса
mean_study = df_students['StudyHours'].mean()

# Получите средний балл, используя название столбца в качестве свойства (просто для наглядности!).
mean_grade = df_students.Grade.mean()

# Распечатать среднее количество часов обучения и среднюю оценку
print('Average weekly study hours: {:.2f}\nAverage grade: {:.2f}'.format(mean_study, mean_grade))

Average weekly study hours: 10.52
Average grade: 49.18

In [ ]:
# Get students who studied for the mean or more hours
df_students[df_students.StudyHours > mean_study]

         Name  StudyHours  Grade
1       Joann       11.50   50.0
3       Rosie       16.00   97.0
6    Frederic       11.50   53.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
14      Jenny       15.50   70.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

In [ ]:
#Какова была их средняя оценка?
df_students[df_students.StudyHours > mean_study].Grade.mean()

np.float64(66.7)

In [ ]:
#добавим новый столбец Pass, в который будет записано True, если студент сдал экзамен (оценка 60 или выше),
#  и False в противном случае.
passes = pd.Series(df_students['Grade'] >= 60)
df_students = pd.concat([df_students, passes.rename('Pass')], axis=1)

df_students

         Name  StudyHours  Grade   Pass
0         Dan       10.00   50.0  False
1       Joann       11.50   50.0  False
2       Pedro        9.00   47.0  False
3       Rosie       16.00   97.0   True
4       Ethan        9.25   49.0  False
5       Vicky        1.00    3.0  False
6    Frederic       11.50   53.0  False
7      Jimmie        9.00   42.0  False
8      Rhonda        8.50   26.0  False
9    Giovanni       14.50   74.0   True
10  Francesca       15.50   82.0   True
11      Rajab       13.75   62.0   True
12    Naiyana        9.00   37.0  False
13       Kian        8.00   15.0  False
14      Jenny       15.50   70.0   True
15     Jakeem        8.00   27.0  False
16     Helena        9.00   36.0  False
17      Ismat        6.00   35.0  False
18      Anila       10.00   48.0  False
19       Skye       12.00   52.0  False
20     Daniel       12.50   63.0   True
21      Aisha       12.00   64.0   True

In [71]:
print(df_students.groupby(df_students.Pass).Name.count())

Pass
False    15
True      7
Name: Name, dtype: int64

In [72]:
print(df_students.groupby(df_students.Pass)[['StudyHours', 'Grade']].mean())

       StudyHours      Grade
Pass
False    8.783333  38.000000
True    14.250000  73.142857

In [73]:
# Create a DataFrame with the data sorted by Grade (descending)
df_students = df_students.sort_values('Grade', ascending=False)

# Show the DataFrame
df_students

         Name  StudyHours  Grade   Pass
3       Rosie       16.00   97.0   True
10  Francesca       15.50   82.0   True
9    Giovanni       14.50   74.0   True
14      Jenny       15.50   70.0   True
21      Aisha       12.00   64.0   True
20     Daniel       12.50   63.0   True
11      Rajab       13.75   62.0   True
6    Frederic       11.50   53.0  False
19       Skye       12.00   52.0  False
0         Dan       10.00   50.0  False
1       Joann       11.50   50.0  False
4       Ethan        9.25   49.0  False
18      Anila       10.00   48.0  False
2       Pedro        9.00   47.0  False
7      Jimmie        9.00   42.0  False
12    Naiyana        9.00   37.0  False
16     Helena        9.00   36.0  False
17      Ismat        6.00   35.0  False
15     Jakeem        8.00   27.0  False
8      Rhonda        8.50   26.0  False
13       Kian        8.00   15.0  False
5       Vicky        1.00    3.0  False